tutorials/viscoelastic/viscoelasticFluidFoam/DCPP/system/sampleDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.1                                |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      sampleDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

interpolationScheme cellPointFace;

setFormat     xmgr;

sets
(
    PSD_0
    {
        type            uniform;
        axis            distance;
        start           (0.076  0.0000001  0.00005);
        end             (0.084  0.0000001  0.00005);
        nPoints         200;
    }

    PSD_04
    {
        type            uniform;
        axis            distance;
        start           (0.076  0.0004  0.00005);
        end             (0.084  0.0004  0.00005);
        nPoints         200;
    }

    PSD_049
    {
        type            uniform;
        axis            distance;
        start           (0.076  0.00049  0.00005);
        end             (0.084  0.00049  0.00005);
        nPoints         200;
    }
);

surfaces
();

fields
(
    PSD
);

// ************************************************************************* //
